Revit 2027 API
View.CanUseTemporaryVisibilityModes Method
 Indicates if view can use temporary visibility modes
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanUseTemporaryVisibilityModes()
Public Function CanUseTemporaryVisibilityModes As Boolean
public:
bool CanUseTemporaryVisibilityModes()
member CanUseTemporaryVisibilityModes : unit -> bool
Return Value
Boolean
 True if view can use temporary visibility modes
See Also
Reference
View Class
Autodesk.Revit.DB Namespace